<?php
// Heading
$_['heading_title']    = 'Поиск с морфологией и релевантностью';

// Text
$_['text_module']         = 'Модули';
$_['text_success']        = 'Модуль удачно обновлен!';

$_['use_morphology']      = 'Использовать при поиске морфологию';
$_['use_relevance']       = 'Использовать при поиске релевантность';

$_['title_string_weight'] = 'Вес вхождения строки поиска в заголовок материала';
$_['title_word_weight']   = 'Вес вхождения слова поиска в заголовок материала';

$_['description_string_weight'] = 'Вес вхождения строки поиска в описание материала';
$_['description_word_weight']   = 'Вес вхождения слова поиска в описание материала';

$_['tag_word_weight']     = 'Вес вхождения слова поиска в тег';

// Error
$_['error_permission'] = 'Внимание: Вы не имеете права модифицировать модуль Поиск с морфологией и релевантностью!';