<?php
class ModelSalePickpoint extends Model {

	public function isGeoZonesExist() {
		$query = $this->db->query("SELECT * FROM " . DB_PREFIX . "geo_zone where geo_zone_id = 4");
	
		if (isset($query->row['geo_zone_id'])) 
			return true;

		return false;

	}

	public function createGeoZones() {

		if ($this->isGeoZonesExist()==true) return false;

		$query = "INSERT INTO `" . DB_PREFIX . "geo_zone` (`geo_zone_id`, `name`, `description`, `date_modified`, `date_added`) VALUES
		(4, 'Москва и область', 'Москва и область', '0000-00-00 00:00:00', '2013-06-15 22:46:33'),
		(5, 'Санкт-Петербург и область', 'Санкт-Петербург и Ленинградская область', '0000-00-00 00:00:00', '2013-06-18 15:21:15'),
		(7, 'Белгородская область', 'Белгородская область', '2013-06-18 21:29:23', '2013-06-18 15:23:13'),
		(8, 'Брянская область', 'Брянская область', '2013-06-18 21:29:35', '2013-06-18 21:24:11'),
		(9, 'Владимирская область', 'Владимирская область', '0000-00-00 00:00:00', '2013-06-18 21:29:57'),
		(10, 'Воронежская область', 'Воронежская область', '0000-00-00 00:00:00', '2013-06-18 21:30:28'),
		(11, 'Ивановская область', 'Ивановская область', '0000-00-00 00:00:00', '2013-06-18 21:30:56'),
		(12, 'Республика Татарстан', 'Республика Татарстан', '0000-00-00 00:00:00', '2013-06-18 21:35:49'),
		(13, 'Калужская область', 'Калужская область', '0000-00-00 00:00:00', '2013-06-18 21:36:39'),
		(14, 'Костромская область', 'Костромская область', '0000-00-00 00:00:00', '2013-06-18 21:37:25'),
		(15, 'Краснодарский край', 'Краснодарский край', '0000-00-00 00:00:00', '2013-06-18 21:37:53'),
		(16, 'Курская область', 'Курская область', '0000-00-00 00:00:00', '2013-06-18 21:38:27'),
		(17, 'Липецкая область', 'Липецкая область', '0000-00-00 00:00:00', '2013-06-18 21:41:42'),
		(18, 'Нижегородская область', 'Нижегородская область', '0000-00-00 00:00:00', '2013-06-18 21:42:18'),
		(19, 'Орловская область', 'Орловская область', '0000-00-00 00:00:00', '2013-06-18 21:42:46'),
		(20, 'Псковская область', 'Псковская область', '0000-00-00 00:00:00', '2013-06-18 21:43:14'),
		(21, 'Ростовская область', 'Ростовская область', '0000-00-00 00:00:00', '2013-06-18 21:43:45'),
		(22, 'Рязанская область', 'Рязанская область', '0000-00-00 00:00:00', '2013-06-18 21:44:15'),
		(28, 'Тульская область', 'Тульская область', '0000-00-00 00:00:00', '2013-06-18 21:47:49'),
		(24, 'Смоленская область', 'Смоленская область', '0000-00-00 00:00:00', '2013-06-18 21:45:10'),
		(25, 'Тамбовская область', 'Тамбовская область', '0000-00-00 00:00:00', '2013-06-18 21:45:34'),
		(26, 'Тверская область', 'Тверская область', '0000-00-00 00:00:00', '2013-06-18 21:45:58'),
		(27, 'Самарская область', 'Самарская область', '0000-00-00 00:00:00', '2013-06-18 21:46:25'),
		(29, 'Ярославская область', 'Ярославская область', '0000-00-00 00:00:00', '2013-06-18 21:48:13'),
		(30, 'Волгоградская область', 'Волгоградская область', '0000-00-00 00:00:00', '2013-06-18 21:49:07'),
		(31, 'Вологодская область', 'Вологодская область', '0000-00-00 00:00:00', '2013-06-18 21:49:43'),
		(32, 'Свердловская область', 'Свердловская область', '0000-00-00 00:00:00', '2013-06-18 21:50:27'),
		(33, 'Удмуртская Республика', 'Удмуртская Республика', '0000-00-00 00:00:00', '2013-06-18 21:51:07'),
		(34, 'Республика Марий Эл', 'Республика Марий Эл', '0000-00-00 00:00:00', '2013-06-18 21:52:19'),
		(35, 'Кировская область', 'Кировская область', '0000-00-00 00:00:00', '2013-06-18 21:52:47'),
		(36, 'Оренбургская область', 'Оренбургская область', '0000-00-00 00:00:00', '2013-06-18 21:53:40'),
		(37, 'Пензенская область', 'Пензенская область', '0000-00-00 00:00:00', '2013-06-18 21:54:04'),
		(38, 'Республика Мордовия', 'Республика Мордовия', '0000-00-00 00:00:00', '2013-06-18 22:13:39'),
		(39, 'Саратовская область', 'Саратовская область', '0000-00-00 00:00:00', '2013-06-18 22:14:11'),
		(40, 'Ставропольский край', 'Ставропольский край', '0000-00-00 00:00:00', '2013-06-18 22:14:50'),
		(41, 'Республика Башкортостан ', 'Республика Башкортостан ', '0000-00-00 00:00:00', '2013-06-18 22:15:51'),
		(42, 'Чувашская Республика', 'Чувашская Республика', '0000-00-00 00:00:00', '2013-06-18 22:16:38'),
		(43, 'Челябинская область', 'Челябинская область', '0000-00-00 00:00:00', '2013-06-18 22:17:02'),
		(44, 'Новосибирская область', 'Новосибирская область', '0000-00-00 00:00:00', '2013-06-18 22:17:31'),
		(45, 'Пермский край', 'Пермский край', '0000-00-00 00:00:00', '2013-06-18 22:17:55'),
		(46, 'Омская область', 'Омская область', '0000-00-00 00:00:00', '2013-06-18 22:18:33'),
		(47, 'Тюменская область', 'Тюменская область', '0000-00-00 00:00:00', '2013-06-18 22:19:30'),
		(48, 'Ульяновская область', 'Ульяновская область', '0000-00-00 00:00:00', '2013-06-18 22:19:54'),
		(49, 'Алтайский край', 'Алтайский край', '0000-00-00 00:00:00', '2013-06-18 22:20:21'),
		(50, 'Кемеровская область', 'Кемеровская область', '0000-00-00 00:00:00', '2013-06-18 22:20:46'),
		(51, 'Красноярский край', 'Красноярский край', '0000-00-00 00:00:00', '2013-06-18 22:21:14'),
		(52, 'Курганская область', 'Курганская область', '0000-00-00 00:00:00', '2013-06-18 22:21:41'),
		(53, 'Ханты-Мансийский АО', 'Ханты-Мансийский АО', '0000-00-00 00:00:00', '2013-06-18 22:22:14'),
		(54, 'Республика Карелия ', 'Республика Карелия ', '0000-00-00 00:00:00', '2013-06-18 22:22:52'),
		(55, 'Томская область', 'Томская область', '0000-00-00 00:00:00', '2013-06-18 22:23:20'),
		(56, 'Архангельская область', 'Архангельская область', '0000-00-00 00:00:00', '2013-06-18 22:23:43'),
		(57, 'Астраханская область', 'Астраханская область', '0000-00-00 00:00:00', '2013-06-18 22:24:09'),
		(58, 'Приморский край', 'Приморский край', '0000-00-00 00:00:00', '2013-06-18 22:24:45'),
		(59, 'Хабаровский край', 'Хабаровский край', '0000-00-00 00:00:00', '2013-06-18 22:25:09'),
		(60, 'Республика Бурятия', 'Республика Бурятия', '0000-00-00 00:00:00', '2013-06-18 22:25:44'),
		(61, 'Мурманская область', 'Мурманская область', '0000-00-00 00:00:00', '2013-06-18 22:26:12'),
		(62, 'Республика Коми ', 'Республика Коми ', '0000-00-00 00:00:00', '2013-06-18 22:26:40'),
		(63, 'Иркутская область', 'Иркутская область', '0000-00-00 00:00:00', '2013-06-18 22:27:02'),
		(64, 'Ямало-Ненецкий АО', 'Ямало-Ненецкий АО', '0000-00-00 00:00:00', '2013-06-18 22:27:28'),
		(65, 'Магаданская область', 'Магаданская область', '0000-00-00 00:00:00', '2013-06-18 22:27:50')";
	
		$this->db->query($query);
	
		$query2 = "INSERT INTO `". DB_PREFIX . "zone_to_geo_zone` (`zone_to_geo_zone_id`, `country_id`, `zone_id`, `geo_zone_id`, `date_added`, `date_modified`) VALUES
		(58, 176, 2761, 4, '2013-06-15 22:46:33', '0000-00-00 00:00:00'),
		(59, 176, 2722, 4, '2013-06-15 22:46:33', '0000-00-00 00:00:00'),
		(60, 176, 2785, 5, '2013-06-18 15:21:15', '0000-00-00 00:00:00'),
		(61, 176, 2735, 5, '2013-06-18 15:21:43', '0000-00-00 00:00:00'),
		(64, 176, 2727, 7, '2013-06-18 21:29:23', '0000-00-00 00:00:00'),
		(65, 176, 2730, 8, '2013-06-18 21:29:35', '0000-00-00 00:00:00'),
		(66, 176, 2799, 9, '2013-06-18 21:29:57', '0000-00-00 00:00:00'),
		(67, 176, 2803, 10, '2013-06-18 21:30:28', '0000-00-00 00:00:00'),
		(68, 176, 2741, 11, '2013-06-18 21:30:56', '0000-00-00 00:00:00'),
		(69, 176, 2746, 12, '2013-06-18 21:35:49', '0000-00-00 00:00:00'),
		(70, 176, 2744, 13, '2013-06-18 21:36:39', '0000-00-00 00:00:00'),
		(71, 176, 2750, 14, '2013-06-18 21:37:25', '0000-00-00 00:00:00'),
		(72, 176, 2751, 15, '2013-06-18 21:37:53', '0000-00-00 00:00:00'),
		(73, 176, 2755, 16, '2013-06-18 21:38:27', '0000-00-00 00:00:00'),
		(74, 176, 2757, 17, '2013-06-18 21:41:42', '0000-00-00 00:00:00'),
		(75, 176, 2766, 18, '2013-06-18 21:42:18', '0000-00-00 00:00:00'),
		(76, 176, 2770, 19, '2013-06-18 21:42:46', '0000-00-00 00:00:00'),
		(77, 176, 2777, 20, '2013-06-18 21:43:14', '0000-00-00 00:00:00'),
		(78, 176, 2778, 21, '2013-06-18 21:43:45', '0000-00-00 00:00:00'),
		(79, 176, 2779, 22, '2013-06-18 21:44:15', '0000-00-00 00:00:00'),
		(85, 176, 2790, 28, '2013-06-18 21:47:49', '0000-00-00 00:00:00'),
		(81, 176, 2784, 24, '2013-06-18 21:45:10', '0000-00-00 00:00:00'),
		(82, 176, 2788, 25, '2013-06-18 21:45:34', '0000-00-00 00:00:00'),
		(83, 176, 2792, 26, '2013-06-18 21:45:58', '0000-00-00 00:00:00'),
		(84, 176, 2781, 27, '2013-06-18 21:46:25', '0000-00-00 00:00:00'),
		(86, 176, 2806, 29, '2013-06-18 21:48:13', '0000-00-00 00:00:00'),
		(87, 176, 2801, 30, '2013-06-18 21:49:07', '0000-00-00 00:00:00'),
		(88, 176, 2802, 31, '2013-06-18 21:49:43', '0000-00-00 00:00:00'),
		(89, 176, 2807, 32, '2013-06-18 21:50:27', '0000-00-00 00:00:00'),
		(90, 176, 2742, 33, '2013-06-18 21:51:07', '0000-00-00 00:00:00'),
		(91, 176, 2808, 34, '2013-06-18 21:52:19', '0000-00-00 00:00:00'),
		(92, 176, 2804, 35, '2013-06-18 21:52:47', '0000-00-00 00:00:00'),
		(93, 176, 2771, 36, '2013-06-18 21:53:40', '0000-00-00 00:00:00'),
		(94, 176, 2773, 37, '2013-06-18 21:54:04', '0000-00-00 00:00:00'),
		(95, 176, 2782, 38, '2013-06-18 22:13:39', '0000-00-00 00:00:00'),
		(96, 176, 2783, 39, '2013-06-18 22:14:11', '0000-00-00 00:00:00'),
		(97, 176, 2786, 40, '2013-06-18 22:14:50', '0000-00-00 00:00:00'),
		(98, 176, 2794, 41, '2013-06-18 22:15:51', '0000-00-00 00:00:00'),
		(99, 176, 2731, 42, '2013-06-18 22:16:38', '0000-00-00 00:00:00'),
		(100, 176, 2732, 43, '2013-06-18 22:17:02', '0000-00-00 00:00:00'),
		(101, 176, 2768, 44, '2013-06-18 22:17:31', '0000-00-00 00:00:00'),
		(102, 176, 2774, 45, '2013-06-18 22:17:55', '0000-00-00 00:00:00'),
		(103, 176, 2769, 46, '2013-06-18 22:18:33', '0000-00-00 00:00:00'),
		(104, 176, 2793, 47, '2013-06-18 22:19:30', '0000-00-00 00:00:00'),
		(105, 176, 2795, 48, '2013-06-18 22:19:54', '0000-00-00 00:00:00'),
		(106, 176, 2726, 49, '2013-06-18 22:20:21', '0000-00-00 00:00:00'),
		(107, 176, 2747, 50, '2013-06-18 22:20:46', '0000-00-00 00:00:00'),
		(108, 176, 2752, 51, '2013-06-18 22:21:14', '0000-00-00 00:00:00'),
		(109, 176, 2754, 52, '2013-06-18 22:21:41', '0000-00-00 00:00:00'),
		(110, 176, 2749, 53, '2013-06-18 22:22:14', '0000-00-00 00:00:00'),
		(111, 176, 2776, 54, '2013-06-18 22:22:52', '0000-00-00 00:00:00'),
		(112, 176, 2789, 55, '2013-06-18 22:23:20', '0000-00-00 00:00:00'),
		(113, 176, 2724, 56, '2013-06-18 22:23:43', '0000-00-00 00:00:00'),
		(114, 176, 2725, 57, '2013-06-18 22:24:09', '0000-00-00 00:00:00'),
		(115, 176, 2800, 58, '2013-06-18 22:24:45', '0000-00-00 00:00:00'),
		(116, 176, 2748, 59, '2013-06-18 22:25:09', '0000-00-00 00:00:00'),
		(117, 176, 2796, 60, '2013-06-18 22:25:44', '0000-00-00 00:00:00'),
		(118, 176, 2762, 61, '2013-06-18 22:26:12', '0000-00-00 00:00:00'),
		(119, 176, 2787, 62, '2013-06-18 22:26:40', '0000-00-00 00:00:00'),
		(120, 176, 2740, 63, '2013-06-18 22:27:02', '0000-00-00 00:00:00'),
		(121, 176, 2780, 64, '2013-06-18 22:27:28', '0000-00-00 00:00:00'),
		(122, 176, 2758, 65, '2013-06-18 22:27:50', '0000-00-00 00:00:00')";
	
		$this->db->query($query2);
	
		$this->cache->delete('geo_zone');
	
		return true;
	}

	public function getPickPointOrders() {
		if ($this->isTableExists() == false) return;

		$query = $this->db->query("SELECT * FROM " . DB_PREFIX . "pickpoint ");
		
		return $query;
	}

	public function isTableExists() {
	    if (mysql_num_rows(mysql_query("SHOW TABLES LIKE '" . DB_PREFIX . "pickpoint'"))) {
	      return TRUE;
	    } else {
	      return FALSE;
	    }
	}

	public function isFieldExists() {
	    if (mysql_num_rows(mysql_query("show columns FROM `" . DB_PREFIX . "pickpoint` where `Field` = 'terminal_address'"))) {
	      return TRUE;
	    } else {
	      return FALSE;
	    }
	}
	
	public function getPickPointOrder($order_id) {
		$query = $this->db->query("SELECT pickpoint_order FROM " . DB_PREFIX . "pickpoint WHERE order_id = '" . (int)$order_id . "'");
		
		if (isset($query->row['pickpoint_order']))
		return $query->row['pickpoint_order'];
		else
		return NULL;
	}

	public function setPickPointOrder($order_id, $order_pickpoint_id) {

		$query = $this->db->query("SELECT pickpoint_order FROM " . DB_PREFIX . "pickpoint WHERE order_id = '" . (int)$order_id . "'");
		
		if (isset($query->row['pickpoint_order']))
		$this->db->query("UPDATE " . DB_PREFIX . "pickpoint SET pickpoint_order='".(int)$order_pickpoint_id."' WHERE order_id = '" . (int)$order_id . "'");
		else
		$this->db->query("INSERT INTO " . DB_PREFIX . "pickpoint SET pickpoint_order='".(int)$order_pickpoint_id."',order_id = '" . (int)$order_id . "', phone = ''");

		$this->SendPickPointOrder($order_id, (int)$order_pickpoint_id);

	}

	public function createPickPointDatabaseTables() {
		$sql  = "CREATE TABLE IF NOT EXISTS `".DB_PREFIX."pickpoint` ( ";
		$sql .= " `order_id` int(11) NOT NULL,";
 		$sql .= " `pickpoint_order` varchar(50) NOT NULL,";
		$sql .= " `terminal_id` varchar(50) NOT NULL, ";
		$sql .= " `terminal_address` varchar(1024) NOT NULL ";

		$sql .= ") ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci ;";
		$this->db->query($sql);


		if ($this->isFieldExists()==false)
		{
			$sql = "ALTER TABLE `" . DB_PREFIX . "pickpoint` ADD COLUMN `terminal_address` VARCHAR(1024) NOT NULL AFTER `terminal_id`";
			$this->db->query($sql);
			$sql = "UPDATE `" . DB_PREFIX . "pickpoint` p left join `" . DB_PREFIX . "order` o on p.order_id = o.order_id set p.terminal_address = o.shipping_method where terminal_address like ''";
			$this->db->query($sql);

		}


	}


	public function getPickPointTerminalId($order_id) {

		$query = $this->db->query("SELECT terminal_id FROM " . DB_PREFIX . "pickpoint WHERE order_id = '" . (int)$order_id . "'");
		
		if (isset($query->row['terminal_id']))
		return $query->row['terminal_id'];
		else
		return NULL;
	}


	public function getPickPointTerminalAddress($order_id) {
		if ($this->isTableExists() == false) return "";

		$query = $this->db->query("SELECT terminal_address FROM " . DB_PREFIX . "pickpoint WHERE order_id = '" . (int)$order_id . "'");
		
		if (isset($query->row['terminal_address']))
		return $query->row['terminal_address'];
		else
		return "";
	}


    public function SendPickPointOrder($order_id, $order_pickpoint_id) {
		
			$this->load->model('sale/order');
			
			$order_info = $this->model_sale_order->getOrder($order_id);

			$language = new Language($order_info['language_directory']);
			$language->load($order_info['language_filename']);
			$language->load('mail/order');

			$subject = sprintf($language->get('text_subject'), $order_info['store_name'], $order_id);

			$message  = '<html>'.$language->get('text_order') . ' ' . $order_id . "<br>";
			$message .= $language->get('text_date_added') . ' ' . date($language->get('date_format_short'), strtotime($order_info['date_added'])) . "<br>";
			
							
				$message .= $language->get('pickpoint_order_mes')." ";
				$message .= strip_tags(html_entity_decode($order_pickpoint_id, ENT_QUOTES, 'UTF-8')) . "<br>";

				$message .= $language->get('pickpoint_order_mes2') . " ";

				$pickpoint_shop_id = $this->config->get('pickpoint_shop_id');

				$message .= "<a href='http://www.pickpoint.ru/monitoring/?shop=".$pickpoint_shop_id."&number=".$order_pickpoint_id."'>"."http://www.pickpoint.ru/monitoring/?shop=".$pickpoint_shop_id."&number=".$order_pickpoint_id ."</a>" . "<br>";


			$message .= $language->get('pickpoint_order_mes3') . "<br>";

			$message .= $language->get('text_footer')."</html>";

			$mail = new Mail();
			$mail->protocol = $this->config->get('config_mail_protocol');
			$mail->parameter = $this->config->get('config_mail_parameter');
			$mail->hostname = $this->config->get('config_smtp_host');
			$mail->username = $this->config->get('config_smtp_username');
			$mail->password = $this->config->get('config_smtp_password');
			$mail->port = $this->config->get('config_smtp_port');
			$mail->timeout = $this->config->get('config_smtp_timeout');
			$mail->setTo($order_info['email']);
			$mail->setFrom($this->config->get('config_email'));
			$mail->setSender($order_info['store_name']);
			$mail->setSubject($subject);
			$mail->setHtml(html_entity_decode($message, ENT_QUOTES, 'UTF-8'));
			$mail->send();
		

		}
	
}
?>