<?php
// Heading
$_['heading_title']    = 'Почта России';

// Text
$_['text_shipping']    = 'Доставка';
$_['text_success']     = 'Настройки модуля обновлены!';

// Entry
$_['entry_cost']       = 'Дополнительная плата за посылку (прибавляется к стоимости товара):';
$_['entry_name']       = 'Название метода доставки (для страницы выбора метода доставки)';
$_['entry_zone']       = 'Регион отправителя:';
$_['entry_city']       = 'Город отправителя:';
$_['entry_status']     = 'Статус:';
$_['entry_sort_order'] = 'Порядок сортировки:';

// Error
$_['error_permission'] = 'У Вас нет прав для управления этим модулем!';
?>