<?php
// Heading
$_['heading_title']      = 'Оплата по счету';

// Text
$_['text_payment']       = 'Оплата';
$_['text_success']       = 'Настройки модуля обновлены!';
$_['text_payment_schet']   = '<img src="view/image/payment/payment_schet.png" alt="Оплата по счету" title="Оплата по счету" style="border: 1px solid #EEEEEE;" />';
$_['text_yes']			 = 'Да';
$_['text_no']		 	 = 'Нет';
$_['text_image_manager'] = 'Менеджер изображений';
$_['text_browse'] 		 = 'Загрузить';
$_['text_clear'] 		 = 'Очистить';

// Ввод
$_['entry_bank']         = 'Поставщик:<br /><span class="help">Пример: Индивидуальный предприниматель Иванов Иван Иванович</span>';
$_['entry_uradres']      = 'Юр. Адрес:<br /><span class="help">Пример: 352900, Краснодарский край, Армавир, Халтурина, д. 2222</span>';
$_['entry_faktadres']    = 'Факт. Адрес:<br /><span class="help">Пример: 352900, Краснодарский край, Армавир, Халтурина, д. 2222</span>';
$_['entry_inn']          = 'ИНН:';
$_['entry_kpp']          = 'КПП:';
$_['entry_rs']           = 'Расчетный счет поставщика:';
$_['entry_bankuser']     = 'Банк поставщика:<br /><span class="help">Пример: АК БАРС БАНК ОАО Краснодарский филиал</span>';
$_['entry_bik']          = 'БИК:';
$_['entry_ks']           = 'Кор./сч. банка поставщика:';
$_['entry_tel']          = 'Телефон / Факс поставщика:<br /><span class="help">Пример: +7(961) 377-18-36</span>';
$_['entry_mobtel']       = 'Мобильный телефон поставщика:<br /><span class="help">Пример: +7 913-685-4545</span>';
$_['entry_punkt']        = 'Пункты договора:<br /><span class="help">Пример: 1. Счет-Договор действителен в течение 5-ти банковских дней, не считая дня выдачи.<br />2. Порядок оплаты: Счет-договор подлежит оплате в рублях в сумме, указанной в счет-договоре.<br />и т.д.</span>';
$_['entry_punkton']	 	 = 'Включить пункты договора в счет:<br /><span class="help">Если "Да", то на печать будет выведен "Счет-Договор"<br />Если "Нет", то на печать будет выведен "Счет"</span>';
$_['entry_image']    	 = 'Печать поставщика:<br /><span class="help">Пропишите ссылку на изображение с печатью поставщика или нажмите кнопку "Загрузить"</span>';
$_['entry_podpis']    	 = 'Подпись поставщика:<br /><span class="help">Пропишите ссылку на изображение с подписью поставщика или нажмите кнопку "Загрузить"</span>';
$_['entry_order_status'] = 'Статус заказа после оплаты:';
$_['entry_geo_zone']     = 'Географическая зона:';
$_['entry_status']       = 'Статус:';
$_['entry_sort_order']   = 'Порядок сортировки:';

// Error
$_['error_permission']   = 'У Вас нет прав для управления этим модулем!';
$_['error_bank']         = 'Это поле обязательно для заполнения!';
?>