<?php
// Text
$_['text_for']          = '%s Подарочный сертефикат для %s';
$_['text_success']      = 'Был произведен перерасчет итогов заказа!';

// Error
$_['error_warning']     = 'Проверьте форму на ошибки!';
$_['error_permission']  = 'У вас нет прав для посещения этой страницы.';
$_['error_customer']    = 'Не найден выбранный клиент!';
$_['error_email']       = 'Проверьте правильность введенного E-mail!';
$_['error_postcode']    = 'Почтовый индекс должен содержать от 2 до 10 символов!';
$_['error_country']     = 'Выберите страну!';
$_['error_zone']        = 'Выберите регион!';
$_['error_stock']       = 'Продукты отмеченные *** отсутствуют на складе, либо их нет в нужном количестве!';
$_['error_minimum']     = 'Минимальная сумма для заказа %s равняется %s!';	
$_['error_required']    = '%s необходим!';
$_['error_shipping']    = 'Выберите способ доставки!';
$_['error_no_shipping'] = 'Нет доступных методов доставки!';
$_['error_payment']     = 'Выберите метож оплаты!';
$_['error_no_payment']  = 'Нет доступных методов оплаты!';
$_['error_coupon']      = 'Истек срок действия купона, либо привышен лимит его использования!';
$_['error_voucher']     = 'Подарочный сертефикат недействителен, просрочен, либо имеет не соответствующий заказ!';
$_['error_reward']      = 'Введите количество бонусных баллов, которые нужно использовать!';	
$_['error_points']      = 'У Вас нет %s бонусных баллов!';
$_['error_maximum']     = 'Максимальное количество баллов, которое можно портатить - %s!';
$_['error_to_name']     = 'Имя получателя должно содержать от 1 до 64 символов!';
$_['error_from_name']   = 'Выше имя должно содержать от 1 до 64 символов!';
$_['error_amount']      = 'Сумма должна быть больше %s и меньше %s!';
?>