<?php
class ModelLocalisationZoneDv extends Model {
	public function getZone($zone_name) {
		foreach($zone_name as $key => $value){
            switch($value){
            	case 'Москва': $send[$key] = 'МОСКВА'; break;
            	case 'Санкт-Петербург': $send[$key] = 'САНКТ-ПЕТЕРБУРГ'; break;
            	case 'Алтайский край': $send[$key] = 'АЛТАЙСКИЙ КРАЙ'; break;
            	case 'Амурская область': $send[$key] = 'АМУРСКАЯ ОБЛАСТЬ'; break;
            	case 'Архангельская область': $send[$key] = 'АРХАНГЕЛЬСКАЯ ОБЛАСТЬ'; break;
            	case 'Астраханская область': $send[$key] = 'АСТРАХАНСКАЯ ОБЛАСТЬ'; break;
            	case 'Белгородская область': $send[$key] = 'БЕЛГОРОДСКАЯ ОБЛАСТЬ'; break;
            	case 'Брянская область': $send[$key] = 'БРЯНСКАЯ ОБЛАСТЬ'; break;
            	case 'Владимирская область': $send[$key] = 'ВЛАДИМИРСКАЯ ОБЛАСТЬ'; break;
            	case 'Волгоградская область': $send[$key] = 'ВОЛГОГРАДСКАЯ ОБЛАСТЬ'; break;
            	case 'Вологодская область': $send[$key] = 'ВОЛОГОДСКАЯ ОБЛАСТЬ'; break;
            	case 'Воронежская область': $send[$key] = 'ВОРОНЕЖСКАЯ ОБЛАСТЬ'; break;
             	case 'Еврейская АО': $send[$key] = 'ЕВРЕЙСКАЯ АВТОНОМНАЯ ОБЛАСТЬ'; break;
            	case 'Забайкальский край': $send[$key] = 'ЗАБАЙКАЛЬСКИЙ КРАЙ'; break;
            	case 'Ивановская область': $send[$key] = 'ИВАНОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Иркутская область': $send[$key] = 'ИРКУТСКАЯ ОБЛАСТЬ'; break;
            	case 'Республика Кабардино-Балкария': $send[$key] = 'КАБАРДИНО-БАЛКАРСКАЯ РЕСПУБЛИКА'; break;
            	case 'Калининградская область': $send[$key] = 'КАЛИНИНГРАДСКАЯ ОБЛАСТЬ'; break;
            	case 'Калужская область': $send[$key] = 'КАЛУЖСКАЯ ОБЛАСТЬ'; break;
            	case 'Камчатский край': $send[$key] = 'КАМЧАТСКИЙ КРАЙ'; break;
             	case 'Карачаево-Черкеcсия': $send[$key] = 'КАРАЧАЕВО-ЧЕРКЕССКАЯ РЕСПУБЛИКА'; break;
            	case 'Кемеровская область': $send[$key] = 'КЕМЕРОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Кировская область': $send[$key] = 'КИРОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Костромская область': $send[$key] = 'КОСТРОМСКАЯ ОБЛАСТЬ'; break;
            	case 'Краснодарский край': $send[$key] = 'КРАСНОДАРСКИЙ КРАЙ'; break;
            	case 'Красноярский край': $send[$key] = 'КРАСНОЯРСКИЙ КРАЙ'; break;
            	case 'Курганская область': $send[$key] = 'КУРГАНСКАЯ ОБЛАСТЬ'; break;
            	case 'Курская область': $send[$key] = 'КУРСКАЯ ОБЛАСТЬ'; break;
            	case 'Ленинградская область': $send[$key] = 'ЛЕНИНГРАДСКАЯ ОБЛАСТЬ'; break;
            	case 'Липецкая область': $send[$key] = 'ЛИПЕЦКАЯ ОБЛАСТЬ'; break;
            	case 'Магаданская область': $send[$key] = 'МАГАДАНСКАЯ ОБЛАСТЬ'; break;
            	case 'Московская область': $send[$key] = 'МОСКОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Мурманская область': $send[$key] = 'МУРМАНСКАЯ ОБЛАСТЬ'; break;
              	case 'Ненецкий АО': $send[$key] = 'НЕНЕЦКИЙ АВТОНОМНЫЙ ОКРУГ'; break;
            	case 'Нижегородская область': $send[$key] = 'НИЖЕГОРОДСКАЯ ОБЛАСТЬ'; break;
            	case 'Новгородская область': $send[$key] = 'НОВГОРОДСКАЯ ОБЛАСТЬ'; break;
            	case 'Новосибирская область': $send[$key] = 'НОВОСИБИРСКАЯ ОБЛАСТЬ'; break;
            	case 'Омская область': $send[$key] = 'ОМСКАЯ ОБЛАСТЬ'; break;
            	case 'Оренбургская область': $send[$key] = 'ОРЕНБУРГСКАЯ ОБЛАСТЬ'; break;
            	case 'Орловская область': $send[$key] = 'ОРЛОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Пензенская область': $send[$key] = 'ПЕНЗЕНСКАЯ ОБЛАСТЬ'; break;
            	case 'Пермский край': $send[$key] = 'ПЕРМСКИЙ КРАЙ'; break;
            	case 'Приморский край': $send[$key] = 'ПРИМОРСКИЙ КРАЙ'; break;
            	case 'Псковская область': $send[$key] = 'ПСКОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Республика Адыгея': $send[$key] = 'АДЫГЕЯ РЕСПУБЛИКА'; break;
            	case 'Республика Алтай': $send[$key] = 'АЛТАЙ РЕСПУБЛИКА'; break;
            	case 'Республика Башкортостан': $send[$key] = 'БАШКОРТОСТАН РЕСПУБЛИКА'; break;
            	case 'Республика Бурятия': $send[$key] = 'БУРЯТИЯ РЕСПУБЛИКА'; break;
            	case 'Республика Дагестан': $send[$key] = 'ДАГЕСТАН РЕСПУБЛИКА'; break;
            	case 'Республика Ингушетия': $send[$key] = 'ИНГУШЕТИЯ РЕСПУБЛИКА'; break;
            	case 'Республика Калмыкия': $send[$key] = 'КАЛМЫКИЯ РЕСПУБЛИКА'; break;
            	case 'Республика Карелия': $send[$key] = 'КАРЕЛИЯ РЕСПУБЛИКА'; break;
            	case 'Республика Коми': $send[$key] = 'КОМИ РЕСПУБЛИКА'; break;
            	case 'Республика Марий Эл': $send[$key] = 'МАРИЙ ЭЛ РЕСПУБЛИКА'; break;
            	case 'Республика Мордовия': $send[$key] = 'МОРДОВИЯ РЕСПУБЛИКА'; break;
            	case 'Республика Саха': $send[$key] = 'САХА (ЯКУТИЯ) РЕСПУБЛИКА'; break;
            	case 'Республика Северная Осетия': $send[$key] = 'СЕВЕРНАЯ ОСЕТИЯ-АЛАНИЯ РЕСПУБЛИКА'; break;
            	case 'Республика Татарстан': $send[$key] = 'ТАТАРСТАН РЕСПУБЛИКА'; break;
            	case 'Республика Тыва': $send[$key] = 'ТЫВА РЕСПУБЛИКА'; break;
            	case 'Республика Хакасия': $send[$key] = 'ХАКАСИЯ РЕСПУБЛИКА'; break;
            	case 'Ростовская область': $send[$key] = 'РОСТОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Рязанская область': $send[$key] = 'РЯЗАНСКАЯ ОБЛАСТЬ'; break;
            	case 'Самарская область': $send[$key] = 'САМАРСКАЯ ОБЛАСТЬ'; break;
            	case 'Саратовская область': $send[$key] = 'САРАТОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Сахалинская область': $send[$key] = 'САХАЛИНСКАЯ ОБЛАСТЬ'; break;
            	case 'Свердловская область': $send[$key] = 'СВЕРДЛОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Смоленская область': $send[$key] = 'СМОЛЕНСКАЯ ОБЛАСТЬ'; break;
            	case 'Ставропольский край': $send[$key] = 'СТАВРОПОЛЬСКИЙ КРАЙ'; break;
            	case 'Таймырский АО': $send[$key] = 'region--tajmyrskij-ao'; break;
            	case 'Тамбовская область': $send[$key] = 'ТАМБОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Тверская область': $send[$key] = 'ТВЕРСКАЯ ОБЛАСТЬ'; break;
            	case 'Томская область': $send[$key] = 'ТОМСКАЯ ОБЛАСТЬ'; break;
            	case 'Тульская область': $send[$key] = 'ТУЛЬСКАЯ ОБЛАСТЬ'; break;
            	case 'Тюменская область': $send[$key] = 'ТЮМЕНСКАЯ ОБЛАСТЬ'; break;
            	case 'Удмуртская Республика': $send[$key] = 'УДМУРТСКАЯ РЕСПУБЛИКА'; break;
            	case 'Ульяновская область': $send[$key] = 'УЛЬЯНОВСКАЯ ОБЛАСТЬ'; break;
            	case 'Хабаровский край': $send[$key] = 'ХАБАРОВСКИЙ КРАЙ'; break;
            	case 'Ханты-Мансийский АО - Югра': $send[$key] = 'ХАНТЫ-МАНСИЙСКИЙ-ЮГРА АВТОНОМНЫЙ ОКРУГ'; break;
            	case 'Челябинская область': $send[$key] = 'ЧЕЛЯБИНСКАЯ ОБЛАСТЬ'; break;
            	case 'Чеченская республика': $send[$key] = 'ЧЕЧЕНСКАЯ РЕСПУБЛИКА'; break;
            	case 'Чувашская Республика': $send[$key] = 'ЧУВАШСКАЯ РЕСПУБЛИКА'; break;
            	case 'Чукотский АО': $send[$key] = 'ЧУКОТСКИЙ АВТОНОМНЫЙ ОКРУГ'; break;
            	case 'Ямало-Ненецкий АО': $send[$key] = 'ЯМАЛО-НЕНЕЦКИЙ АВТОНОМНЫЙ ОКРУГ'; break;
            	case 'Ярославская область': $send[$key] = 'ЯРОСЛАВСКАЯ ОБЛАСТЬ'; break;
            }
  		}


        if(isset($send) && count($send)==2){
			return $send;
		}else{			return false;		}
	}
}
?>